app/views/sponsor/dashboard/new.html.erb

    <div style="width:40rem">
      <%= form.collection_select :domains, Domain.all, :id, :name, {}, {multiple: true, class: "form-select", id: "collection-select", data: { controller: "choices" }} %>
---
SELECT "domains".* FROM "domains"