app/controllers/admin/dashboard_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      @q = Project.all.order(created_at: :desc).ransack(params[:q])
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC

    def delete
      if @project.delete
---
DELETE FROM "projects" WHERE "projects"."id" = 25

    def hide
      @project.update(status: "Hidden")
      if @project.save
---
UPDATE "projects" SET "status" = 'Hidden', "updated_at" = '2025-10-20 14:55:02.782772' WHERE "projects"."id" = 1
UPDATE "projects" SET "status" = 'Hidden', "updated_at" = '2025-11-07 23:20:00.578744' WHERE "projects"."id" = 22

    def unhide
      @project.update(status: "Visible")
      if @project.save
---
UPDATE "projects" SET "status" = 'Visible', "updated_at" = '2025-10-20 14:55:03.940908' WHERE "projects"."id" = 1
UPDATE "projects" SET "status" = 'Visible', "updated_at" = '2025-11-07 23:20:03.103549' WHERE "projects"."id" = 22

    def renew
      if @project.expiration < DateTime.now
        @project.update(status: "Hidden")
      end
      @project.update(expiration: DateTime.now.next_year(2).to_time)
---
UPDATE "projects" SET "expiration" = '2027-10-20 14:54:43.662065', "updated_at" = '2025-10-20 14:54:43.689473' WHERE "projects"."id" = 1

    def set_project
      @project = Project.find_by(id: params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1