app/controllers/admin/dashboard_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "users" ON "users"."id" = "projects"."user_id" ORDER BY "projects"."created_at" DESC
---
    def index
      params[:q] = {} if params[:q].blank?
      @q = Project.all.joins(:user).order(created_at: :desc).ransack(params[:q])