app/controllers/admin/domains_controller.rb

SELECT "domains".* FROM "domains" ORDER BY "domains"."created_at" DESC
---
    def index
      params[:q] = {} if params[:q].blank?
      @q = Domain.all.order(created_at: :desc).ransack(params[:q])

UPDATE "domains" SET "name" = 'test2', "updated_at" = '2025-11-11 18:38:12.771662' WHERE "domains"."id" = 2
---
    def update
      if @domain.update(domain_params)

DELETE FROM "domains" WHERE "domains"."id" = 4
---
    def delete
      if @domain.delete

INSERT INTO "domains" ("name", "category", "project_id", "created_at", "updated_at") VALUES ('new', NULL, NULL, '2025-11-11 18:55:46.290489', '2025-11-11 18:55:46.290489') RETURNING "id"
---
    def create
      @domain = Domain.new(domain_params)
      if @domain.save

SELECT "domains".* FROM "domains" WHERE "domains"."id" IS NULL LIMIT 1
---
    def set_domain
      @domain = Domain.find_by(id: params[:id])