app/controllers/admin/users_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      @q = User.all.order(created_at: :desc).ransack(params[:q])
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

    def delete
      if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 12

    def disable
      @user.update(status: "Disabled")
---
UPDATE "users" SET "updated_at" = '2025-11-10 21:08:02.639588', "status" = 'Disabled' WHERE "users"."id" = 11

    def reactivate
      @user.update(status: "Active")
---
UPDATE "users" SET "updated_at" = '2025-11-10 21:08:06.224235', "status" = 'Active' WHERE "users"."id" = 11

    def set_user
      @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1