app/views/students/index.html.erb

        <td><%= user.name %></td>
        <td><%= user.domains.pluck(:name) %></td>
---
SELECT "domains"."name" FROM "domains" INNER JOIN "domains_users" ON "domains"."id" = "domains_users"."domain_id" WHERE "domains_users"."user_id" = 9