app/views/admin/dashboard/show.html.erb

SELECT "domains"."name" FROM "domains" INNER JOIN "domains_projects" ON "domains"."id" = "domains_projects"."domain_id" WHERE "domains_projects"."project_id" = 9
---
  Description: <%= @project.long_desc %><br>
  Domains: <%= @project.domains.pluck(:name) %><br>