app/views/student/dashboard/new.html.erb

SELECT "domains".* FROM "domains"
---
    <div style="width:40rem">
      <%= form.collection_select :domains, Domain.all, :id, :name, {}, {multiple: true, class: "form-select", id: "collection-select", data: { controller: "choices" }} %>