app/controllers/sponsor/dashboard_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1 ORDER BY "projects"."created_at" DESC
---
    def index
      params[:q] = {} if params[:q].blank?
      @q = Project.where(user: current_user).order(created_at: :desc).ransack(params[:q])

SELECT "domains".* FROM "domains"
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
INSERT INTO "projects" ("name", "short_desc", "long_desc", "status", "user_id", "expiration", "created_at", "updated_at") VALUES ('test', 'test', 'test', 'Visible', 1, '2027-10-15 18:07:14.778113', '2025-10-15 18:07:14.800328', '2025-10-15 18:07:14.800328') RETURNING "id"
SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1
UPDATE "projects" SET "name" = 'ta', "updated_at" = '2025-10-06 19:08:32.145724' WHERE "projects"."id" = 1
INSERT INTO "projects" ("name", "short_desc", "long_desc", "status", "user_id", "expiration", "created_at", "updated_at") VALUES ('test', 'test', 'test', 'Visible', 1, '2027-10-15 19:12:13.940996', '2025-10-15 19:12:13.970411', '2025-10-15 19:12:13.970411') RETURNING "id"
---
    def create
      #Creates the new project including the current user and an expiration date that is 2 years from now
      @project = Project.new(project_params.merge(user: current_user, expiration: DateTime.now.next_year(2).to_time))
      #Adds the domains to the project (the domains are foreign keys used for searching)
      params["project"]["domains"].each do |domain|
        if domain!=""
          @project.domains << Domain.find(domain.to_i)
        end
      end
      #Saves the project if possible
      if @project.save

UPDATE "projects" SET "name" = 'example2', "updated_at" = '2025-10-29 18:32:10.909939' WHERE "projects"."id" = 12
DELETE FROM "projects" WHERE "projects"."id" = 4
---
    def update
      #@project.images.attach(project_params[:images])
      if @project.update(project_params)
        #Adds domains to the project (the domains are foreign keys used for searching) or clears the domains if there are none in params
        params["project"]["domains"].each do |domain|
          if domain!=""
            @project.domains << Domain.find(domain.to_i)
          else
            @project.domains.clear

DELETE FROM "projects" WHERE "projects"."id" = 1
---
    def delete
      if @project.delete

UPDATE "projects" SET "status" = 'Visible', "updated_at" = '2025-10-07 04:11:22.371390' WHERE "projects"."id" = 5
UPDATE "projects" SET "status" = 'Visible', "updated_at" = '2025-10-29 18:19:01.185650' WHERE "projects"."id" = 11
---
    def hide
      @project.update(status: "Hidden")
      if @project.save

UPDATE "projects" SET "expiration" = '2027-10-07 04:14:03.671468', "updated_at" = '2025-10-07 04:14:03.672245' WHERE "projects"."id" = 5
---
    def unhide
      @project.update(status: "Visible")

UPDATE "projects" SET "expiration" = '2027-10-29 18:19:16.634850', "updated_at" = '2025-10-29 18:19:16.636332' WHERE "projects"."id" = 11
---
    def renew
      if @project.expiration < DateTime.now
        @project.update(status: "Hidden")

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1 ORDER BY "projects"."updated_at" DESC
---
    def set_project
      @project = Project.find_by(id: params[:id], user: current_user)