app/controllers/student/dashboard_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      @q = Project.where(user: current_user).order(created_at: :desc).ransack(params[:q])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 9 ORDER BY "projects"."created_at" DESC

    def create
      #Creates the new project including the current user and an expiration date that is 2 years from now
      @project = Project.new(project_params.merge(user: current_user, expiration: DateTime.now.next_year(2).to_time))
      #Adds the domains to the project (the domains are foreign keys used for searching)
      params["project"]["domains"].each do |domain|
        if domain!=""
          @project.domains << Domain.find(domain.to_i)
        end
      end
      #Saves the project if possible
      if @project.save
---
SELECT "domains".* FROM "domains"
INSERT INTO "projects" ("name", "short_desc", "long_desc", "status", "user_id", "expiration", "created_at", "updated_at") VALUES ('student', 'student', 'student', 'Visible', 9, '2027-11-07 00:50:24.846334', '2025-11-07 00:50:24.856543', '2025-11-07 00:50:24.856543') RETURNING "id"

    def hide
      @project.update(status: "Hidden")
---
UPDATE "projects" SET "status" = 'Hidden', "updated_at" = '2025-11-07 17:13:02.571342' WHERE "projects"."id" = 21

    def unhide
      @project.update(status: "Visible")
---
UPDATE "projects" SET "status" = 'Visible', "updated_at" = '2025-11-07 17:13:04.048583' WHERE "projects"."id" = 21

    def set_project
      @project = Project.find_by(id: params[:id], user: current_user)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 16 AND "projects"."user_id" = 9 LIMIT 1