app/controllers/sponsors_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      @q = User.where(role: "Sponsor", status: "Active").distinct.ransack(params[:q])
      @users = @q.result
      @q_organization_cont = params[:q][:organization_cont] #Search by organization
      @q_domains_id_in = params[:q][:domains_id_in] #Search by domain search tag
      @domains = Domain.all
---
SELECT "users".* FROM "users" WHERE "users"."role" = 'Sponsor' AND "users"."status" = 'Active'
SELECT "domains".* FROM "domains"