app/controllers/sponsor_projects_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      project_ids = Project.belongs_to_sponsor.active_projects.pluck(:id)
      @q = Project.joins(:user).where(id:project_ids).where("expiration >= ?", DateTime.now).where(status:"Visible").order(updated_at: :desc).ransack(params[:q])
      @projects = @q.result
      @q_name_cont = params[:q][:name_cont]
      @q_user_organization_cont = params[:q][:user_organization_cont]
      @q_domains_id_in = params[:q][:domains_id_in]
      @domains = Domain.all
---
SELECT "projects".* FROM "projects" LEFT OUTER JOIN "domains_projects" ON "domains_projects"."project_id" = "projects"."id" LEFT OUTER JOIN "domains" ON "domains"."id" = "domains_projects"."domain_id" WHERE "projects"."status" = 'Visible' AND "domains"."id" IN (1) ORDER BY "projects"."updated_at" DESC
SELECT "domains".* FROM "domains"

    def show
      if Project.where(id:params[:id]).exists?
---
SELECT 1 AS one FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1