app/controllers/sponsor_projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (expiration >= '2025-11-03 23:27:47.514377') AND "projects"."status" = 'Visible' ORDER BY "projects"."updated_at" DESC
---
    def index
      params[:q] = {} if params[:q].blank?
      @q = Project.where("expiration >= ?", DateTime.now).where(status:"Visible").order(updated_at: :desc).ransack(params[:q])