app/controllers/student_projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (expiration >= '2025-11-05 17:56:54.199586') AND "projects"."status" = 'Visible' ORDER BY "projects"."updated_at" DESC
SELECT "domains".* FROM "domains"
---
    def index
      params[:q] = {} if params[:q].blank?
      project_ids = Project.belongs_to_student.active_projects
      @q = Project.where(id:project_ids).where("expiration >= ?", DateTime.now).where(status:"Visible").order(updated_at: :desc).ransack(params[:q])
      @projects = @q.result
      @q_name_cont = params[:q][:name_cont]
      @q_user_name_cont = params[:q][:user_name_cont]
      @q_domains_id_in = params[:q][:domains_id_in]
      @domains = Domain.all

SELECT 1 AS one FROM "projects" WHERE "projects"."id" = 11 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 11 LIMIT 1
---
    def show
      if Project.where(id:params[:id]).exists?