app/controllers/students_controller.rb

    def index
      params[:q] = {} if params[:q].blank?
      @q = User.where(role: "Student", status: "Active").distinct.ransack(params[:q])
      @users = @q.result
      @q_name_cont = params[:q][:name_cont] #Search by name
      @q_domains_id_in = params[:q][:domains_id_in] #Search by domain search tag
      @domains = Domain.all
---
SELECT "users".* FROM "users" WHERE "users"."role" = 'Student' AND "users"."status" = 'Active'
SELECT "domains".* FROM "domains"