app/controllers/users_controller.rb

  def create
    @user = User.new(user_params.merge(status:"Active"))
    if @user.save
      #Adds domains to the user (the domains are foreign keys used for searching)
        params["user"]["domains"].each do |domain|
          if domain!=""
            @user.domains << Domain.find(domain.to_i)
---
INSERT INTO "users" ("name", "organization", "contact", "role", "username", "email", "password_digest", "created_at", "updated_at", "email_confirmed", "confirm_token", "status") VALUES ('temp', 'temp', 'temp', 'Sponsor', 'temp', 'lowend1@umbc.edu', '$2a$12$CKLiqrxgayEylGlpdIwOWerdhdneUbhw1iChNoFE4tZyzDhZoFu4q', '2025-11-11 17:01:30.732372', '2025-11-11 17:01:30.732372', FALSE, 'YZzWpiXYAQJfzeePyDHj5g', 'Active') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "users" ("name", "organization", "contact", "role", "username", "email", "password_digest", "created_at", "updated_at", "email_confirmed", "confirm_token", "status") VALUES ('test', '', 'test', 'Student', 'test', 'test', '$2a$12$eH/V12dxXYSl1yCJA3XGrODvvs4oVFNHz.LfjwktH5aFRgCdudk46', '2025-11-14 00:57:23.268277', '2025-11-14 00:57:23.268277', FALSE, 'j9j7OtID2yRc37iK2pOjRg', 'Active') RETURNING "id"

  def confirm_email
    user = User.find_by_confirm_token(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."confirm_token" = 'CVFZzAhdOpPeshko5xspsw' LIMIT 1